particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */
#include "logging.h"
#include "spi_hal.h"
#include "pinmap_hal.h"
#include "pinmap_impl.h"
#include "gpio_hal.h"
#include "interrupts_hal.h"
#include "concurrent_hal.h"
#include "delay_hal.h"
#include "check.h"
#include "service_debug.h"
extern "C" {
#include "rtl8721d.h"
extern void SSI_SetDataSwap(SPI_TypeDef *spi_dev, u32 SwapStatus, u32 newState);
// #include "rtl8721d_ssi.h"
// #include "rtl8721dhp_rcc.h"
}

#include <memory>
#include <cstdlib>

#define DEFAULT_SPI_MODE        SPI_MODE_MASTER
#define DEFAULT_DATA_MODE       SPI_MODE3
#define DEFAULT_DATA_BITS       DFS_8_BITS
#define DEFAULT_BIT_ORDER       MSBFIRST
#define DEFAULT_SPI_CLOCKDIV    SPI_CLOCK_DIV256

#define CFG_SPI_PRIORITY        6
#define CFG_GDMA_TX_PRIORITY    4
#define CFG_GDMA_RX_PRIORITY    3
#define CFG_CHUNK_BUF_SIZE      32

static_assert((CFG_CHUNK_BUF_SIZE&0x1f) == 0, "Chunk size should be multiple of 32-byte");

namespace {

// Copied from spark_wiring_interrupts.h
// Ideally this should be moved into services. HAL shouldn't depend on wiring
class AtomicSection {
    int prev_;
public:
    AtomicSection() {
        prev_ = HAL_disable_irq();
    }

    ~AtomicSection() {
        HAL_enable_irq(prev_);
    }
};

class Spi;
Spi* getInstance(hal_spi_interface_t spi);

typedef struct {
    hal_spi_mode_t  spiMode;
    uint8_t         dataMode;
    uint8_t         bitOrder;
    uint32_t        clockDiv;
    void reset() {
        spiMode  = DEFAULT_SPI_MODE;
        dataMode = DEFAULT_DATA_MODE;
        bitOrder = DEFAULT_BIT_ORDER;
        clockDiv = DEFAULT_SPI_CLOCKDIV;
    }
} SpiConfig;

typedef struct {
    volatile const uint8_t*     txBuf;
    volatile uint8_t*           rxBuf;
    size_t                      txLength;
    size_t                      rxLength;
    void reset() {
        txBuf  = nullptr;
        rxBuf  = nullptr;
        txLength = 0;
        rxLength = 0;
    }
} SpiBufferConfig;

typedef struct {
    volatile __attribute__((aligned(32))) uint8_t    txBuf[CFG_CHUNK_BUF_SIZE];
    volatile __attribute__((aligned(32))) uint8_t    rxBuf[CFG_CHUNK_BUF_SIZE];
    volatile size_t                                  txLength;
    volatile size_t                                  rxLength;
    volatile size_t                                  txIndex;
    volatile size_t                                  rxIndex;
} SpiChunkBufferConfig;

typedef struct {
    hal_spi_dma_user_callback       dmaUserCb;
    hal_spi_select_user_callback    selectUserCb;
    void reset() {
        dmaUserCb = nullptr;
        selectUserCb = nullptr;
    }
} SpiCallbackConfig;

typedef struct {
    volatile hal_spi_state_t    state;
    volatile bool               receiving;
    volatile bool               transmitting;
    volatile bool               csPinSelected;
    volatile bool               userDmaCbHandled;
    volatile uint16_t           transferredLength;
    volatile uint16_t           configuredTransferLength;
} SpiStatus;

void spiModeToPolAndPha(uint32_t spiMode, uint32_t* polarity, uint32_t* phase) {
    /*
    * mode | POL PHA
    * -----+--------
    *   0  |  0   0
    *   1  |  0   1
    *   2  |  1   0
    *   3  |  1   1
    *
    * SCPOL_INACTIVE_IS_LOW  = 0,
    * SCPOL_INACTIVE_IS_HIGH = 1
    *
    * SCPH_TOGGLES_IN_MIDDLE = 0,
    * SCPH_TOGGLES_AT_START  = 1
    */
    switch (spiMode) {
        case SPI_MODE0: {
            *polarity = SCPOL_INACTIVE_IS_LOW;
            *phase    = SCPH_TOGGLES_IN_MIDDLE;
            break;
        };
        case SPI_MODE1: {
            *polarity = SCPOL_INACTIVE_IS_LOW;
            *phase    = SCPH_TOGGLES_AT_START;
            break;
        };
        case SPI_MODE2: {
            *polarity = SCPOL_INACTIVE_IS_HIGH;
            *phase    = SCPH_TOGGLES_IN_MIDDLE;
            break;
        };
        case SPI_MODE3: {
            *polarity = SCPOL_INACTIVE_IS_HIGH;
            *phase    = SCPH_TOGGLES_AT_START;
            break;
        };
        default:
            // Shouldn't enter this case after parameter check
            *polarity = SCPOL_INACTIVE_IS_HIGH;
            *phase    = SCPH_TOGGLES_AT_START;
            break;
    }
}

void clockDivToRtlClockDiv(uint32_t clockDiv, uint32_t* rtlClockDivider) {
    switch (clockDiv) {
        case SPI_CLOCK_DIV2:   *rtlClockDivider = 2;   break;
        case SPI_CLOCK_DIV4:   *rtlClockDivider = 4;   break;
        case SPI_CLOCK_DIV8:   *rtlClockDivider = 8;   break;
        case SPI_CLOCK_DIV16:  *rtlClockDivider = 16;  break;
        case SPI_CLOCK_DIV32:  *rtlClockDivider = 32;  break;
        case SPI_CLOCK_DIV64:  *rtlClockDivider = 64;  break;
        case SPI_CLOCK_DIV128: *rtlClockDivider = 128; break;
        case SPI_CLOCK_DIV256: *rtlClockDivider = 256; break;
        default:               *rtlClockDivider = 256; break;
    }
}

class Spi {
public:
    Spi(hal_spi_interface_t spiInterface, int rtlSpiIndex, uint32_t spiInputClock, int prio,
            hal_pin_t csPin, hal_pin_t clkPin, hal_pin_t mosiPin, hal_pin_t misoPin)
            : spiInterface_(spiInterface),
              rtlSpiIndex_(rtlSpiIndex),
              spiInputClock_(spiInputClock),
              prio_(prio),
              csPin_(csPin),
              sclkPin_(clkPin),
              mosiPin_(mosiPin),
              misoPin_(misoPin),
              config_{},
              bufferConfig_{},
              callbackConfig_{},
              ssPinState_{},
              rxDmaInitStruct_{},
              txDmaInitStruct_{},
              mutex_{},
              status_{} {
        config_.reset();
    }

