particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
    int init() {
        AtomicSection lk;

        if (isEnabled()) {
            CHECK(end());
        }
        if (mutex_ == nullptr) {
            os_mutex_recursive_create(&mutex_);
        }
        config_.reset();
        bufferConfig_.reset();
        return SYSTEM_ERROR_NONE;
    }

    int deinit() {
        end();
        os_mutex_recursive_destroy(&mutex_);
        return SYSTEM_ERROR_NONE;
    }

    int begin(const SpiConfig& config) {
        return begin(csPin_, config);
    }

    int begin(uint16_t csPin, const SpiConfig& config) {
        AtomicSection lk;

        // Start address of chunk buffer should be 32-byte aligned
        SPARK_ASSERT(((uint32_t)chunkBuffer_.txBuf & 0x1f) == 0);
        SPARK_ASSERT(((uint32_t)chunkBuffer_.rxBuf & 0x1f) == 0);
        CHECK_TRUE(validateConfig(rtlSpiIndex_, config), SYSTEM_ERROR_INVALID_ARGUMENT);

        if (isEnabled()) {
            CHECK(end());
        }

        // Allocate dam channels
        CHECK(initDmaChannels());

        // Save config
        if (csPin == SPI_DEFAULT_SS) {
            if (spiInterface_ == HAL_SPI_INTERFACE1) {
                csPin_ = SS;
            } else if (spiInterface_ == HAL_SPI_INTERFACE2) {
                csPin_ = SS1;
            } else {
                csPin_ = PIN_INVALID;
            }
        } else {
            csPin_ = csPin;
        }
        memcpy(&config_, &config, sizeof(SpiConfig));

        SSI_InitTypeDef SSI_InitStruct;
        SSI_StructInit(&SSI_InitStruct);

        // Enable SPI Clock
        if (rtlSpiIndex_ == 0) {
            RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, ENABLE);
        } else {
            RCC_PeriphClockCmd(APBPeriph_SPI1, APBPeriph_SPI1_CLOCK, ENABLE);
        }

        // Configure GPIO and Role
        if (config_.spiMode == SPI_MODE_MASTER) {
            SSI_InitStruct.SPI_Role = SSI_MASTER;
            // NOTE: Extra setting for SPI0_DEV, please refer to rtl8721dhp_ssi.c
            if (rtlSpiIndex_ == 0) {
                SSI_SetRole(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, SSI_MASTER);
            }
            // FIXME: a noise is observed on the MOSI pin, adding a pullup here is not ideal,
            // fix it when we find a better way e.g. improve driving strength
            hal_gpio_mode(mosiPin_, INPUT_PULLUP);
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(sclkPin_), PINMUX_FUNCTION_SPIM);
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(mosiPin_), PINMUX_FUNCTION_SPIM);
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(misoPin_), PINMUX_FUNCTION_SPIM);

            hal_gpio_write(csPin_, 1);
            hal_gpio_mode(csPin_, OUTPUT);
        } else {
            SSI_InitStruct.SPI_Role = SSI_SLAVE;
            // NOTE: Extra setting for SPI0_DEV, please refer to rtl8721dhp_ssi.c
            if (rtlSpiIndex_ == 0) {
                SSI_SetRole(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, SSI_SLAVE);
            }
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(sclkPin_), PINMUX_FUNCTION_SPIS);
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(mosiPin_), PINMUX_FUNCTION_SPIS);
            Pinmux_Config((uint8_t)hal_pin_to_rtl_pin(misoPin_), PINMUX_FUNCTION_SPIS);
            hal_gpio_mode(csPin_, INPUT_PULLUP);
            hal_interrupt_attach(csPin_, onSelectedHandler, this, CHANGE, nullptr);
        }
        SSI_Init(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, &SSI_InitStruct);

        uint32_t phase = SCPH_TOGGLES_IN_MIDDLE;
        uint32_t polarity = SCPOL_INACTIVE_IS_LOW;
        spiModeToPolAndPha(config_.dataMode, &polarity, &phase);
        SSI_SetSclkPhase(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, phase);
        SSI_SetSclkPolarity(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, polarity);
        SSI_SetDataFrameSize(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DEFAULT_DATA_BITS);
        if (polarity == SCPOL_INACTIVE_IS_LOW) {
            PAD_PullCtrl((uint8_t)hal_pin_to_rtl_pin(sclkPin_), GPIO_PuPd_DOWN);
        } else {
            PAD_PullCtrl((uint8_t)hal_pin_to_rtl_pin(sclkPin_), GPIO_PuPd_UP);
        }

        // Set pin function
        hal_pin_set_function(sclkPin_, PF_SPI);
        hal_pin_set_function(mosiPin_, PF_SPI);
        hal_pin_set_function(misoPin_, PF_SPI);

        // Set clock divider
        if (config_.spiMode == SPI_MODE_MASTER) {
            u32 rtlClockDivider = 256;
            clockDivToRtlClockDiv(config_.clockDiv, &rtlClockDivider);
            SSI_SetBaudDiv(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, rtlClockDivider);
        }

        // Set bit order
        if (config_.bitOrder == MSBFIRST) {
            SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_TXBITSWP, DISABLE);
            SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_RXBITSWP, DISABLE);
        } else {
            SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_TXBITSWP, ENABLE);
            SSI_SetDataSwap(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, BIT_CTRLR0_RXBITSWP, ENABLE);
        }

        // Enable SPI DMA
        SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE, BIT_SHIFT_DMACR_TDMAE);
        SSI_SetDmaEnable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE, BIT_SHIFT_DMACR_RDMAE);

        // We don't use SPI interrupt
        SSI_INTConfig(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, (BIT_IMR_RXFIM | BIT_IMR_RXOIM | BIT_IMR_RXUIM), DISABLE);
        SSI_INTConfig(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, (BIT_IMR_TXOIM | BIT_IMR_TXEIM), DISABLE);
        InterruptRegister(interruptHandler, SPI_DEV_TABLE[rtlSpiIndex_].IrqNum, (u32)this, prio_);
        NVIC_ClearPendingIRQ(SPI_DEV_TABLE[rtlSpiIndex_].IrqNum);
        InterruptDis(SPI_DEV_TABLE[rtlSpiIndex_].IrqNum);

        // Clear dma interrupt
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);

        // Update state
        status_.state = HAL_SPI_STATE_ENABLED;

        //LOG_DEBUG(INFO, "SPI begin! mode: %d, order: %s",config_.dataMode, config_.bitOrder ? "MSB" : "LSB");

        return SYSTEM_ERROR_NONE;
    }

