particle-iot/device-os/hal/src/rtl872x/spi_hal.cpp
    int transferDma(const uint8_t* txBuf, uint8_t* rxBuf, size_t size, hal_spi_dma_user_callback callback) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);

        // Wait for last SPI master transfer finished
        while ((config_.spiMode == SPI_MODE_MASTER) && isBusy()) {
            ;
        }

        AtomicSection lk;

        // Reset SPI in case the data in the buffer is not read completely in the last transfer
        transferDmaCancel();
        SSI_Cmd(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DISABLE);
        SSI_Cmd(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE);

        bufferConfig_.rxBuf = rxBuf;
        bufferConfig_.rxLength = size;
        bufferConfig_.txBuf = txBuf;
        bufferConfig_.txLength = size;

        callbackConfig_.dmaUserCb = callback;
        status_.configuredTransferLength = size;
        status_.transferredLength = 0;

        chunkBuffer_.txIndex = 0;
        chunkBuffer_.rxIndex = 0;

        startTransmission();
        startReceiver();

        return SYSTEM_ERROR_NONE;
    }

    int transferDmaCancel() {
        AtomicSection lk;

        /* Clear Pending ISR */
        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);

        status_.transmitting = false;
        status_.receiving = false;
        callbackConfig_.dmaUserCb = nullptr;

        // Flush fifo
        u32 rxFifoLevel;
        while (SSI_Readable(SPI_DEV_TABLE[rtlSpiIndex_].SPIx)) {
            rxFifoLevel = SSI_GetRxCount(SPI_DEV_TABLE[rtlSpiIndex_].SPIx);
            for (u32 i = 0; i < rxFifoLevel; i++) {
                SSI_ReadData(SPI_DEV_TABLE[rtlSpiIndex_].SPIx);
            }
        }

        return SYSTEM_ERROR_NONE;
    }

    SpiConfig config() const {
        return config_;
    }

    int setConfig(SpiConfig& config) {
        CHECK_TRUE(validateConfig(rtlSpiIndex_, config), SYSTEM_ERROR_INVALID_ARGUMENT);
        memcpy(&config_, &config, sizeof(SpiConfig));
        return SYSTEM_ERROR_NONE;
    }

    SpiStatus status() const {
        return status_;
    }

    uint32_t getSpiInputClock() const {
        return spiInputClock_;
    }

    hal_pin_t csPin() const {
        return csPin_;
    }

    bool isEnabled() const {
        return status_.state == HAL_SPI_STATE_ENABLED;
    }

    bool isBusy() const {
        return status_.transmitting || status_.receiving;
    }

    bool isSuspended() const {
        return status_.state == HAL_SPI_STATE_SUSPENDED;
    }

    bool isDmaBufferConfigured() const {
        // Use at least one buffer for SPI transfer
        return bufferConfig_.txBuf || bufferConfig_.rxBuf;
    }

    int registerSelectUserCb(hal_spi_select_user_callback callback) {
        callbackConfig_.selectUserCb = callback;
        return SYSTEM_ERROR_NONE;
    }

    void interruptHandlerImpl() {
        u32 interruptStatus = SSI_GetIsr(SPI_DEV_TABLE[rtlSpiIndex_].SPIx);
        SSI_SetIsrClean(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, interruptStatus);

        if (interruptStatus & (BIT_ISR_TXOIS | BIT_ISR_RXUIS | BIT_ISR_RXOIS | BIT_ISR_MSTIS)) {
            LOG_DEBUG(WARN, "SPI error 0x%08x", interruptStatus);
        }
    }

    void dmaTxHandlerImpl() {
        // Clear Pending ISR, free TX DMA resource
        GDMA_ChCleanAutoReload(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_Cmd(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum, DISABLE);
        uint32_t isrTypeMap = GDMA_ClearINT(txDmaInitStruct_.GDMA_Index, txDmaInitStruct_.GDMA_ChNum);
        (void)isrTypeMap;
        status_.transmitting = false;

        chunkBuffer_.txIndex += chunkBuffer_.txLength;

        startTransmission();
    }

    void dmaRxHandlerImpl() {
        // Clear Pending ISR, free RX DMA resource
        GDMA_ChCleanAutoReload(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, CLEAN_RELOAD_SRC_DST);
        GDMA_Cmd(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum, DISABLE);
        GDMA_ClearINT(rxDmaInitStruct_.GDMA_Index, rxDmaInitStruct_.GDMA_ChNum);
        status_.receiving = false;

        /// Transfer in progress
        uint32_t copyLength = 0;
        copyLength = std::min(bufferConfig_.rxLength - chunkBuffer_.rxIndex, (size_t)chunkBuffer_.rxLength);
        if (bufferConfig_.rxBuf) {
            DCache_Invalidate((u32) chunkBuffer_.rxBuf, chunkBuffer_.rxLength);
            memcpy((void*)&bufferConfig_.rxBuf[chunkBuffer_.rxIndex], (void*)chunkBuffer_.rxBuf, copyLength);
            DCache_CleanInvalidate((u32) bufferConfig_.rxBuf, bufferConfig_.rxLength);
        }
        chunkBuffer_.rxIndex += copyLength;

        startReceiver();
    }

    void onSelectedHandlerImpl() {
        status_.csPinSelected = !hal_gpio_read(csPin_);
        if (callbackConfig_.selectUserCb) {
            (*callbackConfig_.selectUserCb)(status_.csPinSelected);
        }

        if (isDmaBufferConfigured()) {
            if (status_.csPinSelected) {
                status_.userDmaCbHandled = false;
                SSI_Cmd(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, ENABLE);

                // Releaod DMA buffer
                startTransmission();
                startReceiver();
            } else {
                stopTransfer();
                SSI_Cmd(SPI_DEV_TABLE[rtlSpiIndex_].SPIx, DISABLE);
                if (status_.userDmaCbHandled == false) {
                    // SPI master sends the data that is less than the buffer size in the SPI slave
                    if (callbackConfig_.dmaUserCb) {
                        (*callbackConfig_.dmaUserCb)();
                    }
                }
            }
        }
    }

